mwg.wb.pkg.productold/soapxml/GetRefSalePriceOfProduct.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <GetRefSalePriceOfProduct xmlns="http://tempuri.org/">
      <objResultMessage>
        <IsError>false</IsError>
        <ErrorType>GetData</ErrorType>
        <Message>string</Message>
        <MessageDetail>string</MessageDetail>
        <ErrorCode>0</ErrorCode>
        <Parram>string</Parram>
      </objResultMessage>
      <strProductID>{strProductID}</strProductID>
      <intBrandID>{intBrandID}</intBrandID>
      <intInventoryStatusID>{intInventoryStatusID}</intInventoryStatusID>
    </GetRefSalePriceOfProduct>
  </soap:Body>
</soap:Envelope>